src/Reports/ОчередьСогласованияТрудозатрат/ОчередьСогласованияТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОчередьСогласованияТрудозатрат</name>
</mdclass:Report>

src/InformationRegisters/ОценкаТрудозатратПоЗадачам/ОценкаТрудозатратПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаТрудозатратПоЗадачам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольИсполнителяЗадачи</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОчередьСогласованияТрудозатрат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СведенияОВнешнейОбработке
// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
		
	Мета = ЭтотОбъект.Метаданные();
	Версия = Мета.Комментарий;
	ВерсияБСП = "3.1.7.82";
	ТекущаяВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = Версия;
	ПараметрыРегистрации.Наименование = Мета.Представление();
	ПараметрыРегистрации.Информация = Мета.Представление();
	ПараметрыРегистрации.Назначение.Добавить("Подсистема.КонтрольТрудозатрат");
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "_" + Мета.Представление();
	НоваяКоманда.Идентификатор = Мета.ПолноеИмя();
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
#КонецОбласти

#Область ВариантыОтчетов
// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
  Настройки.События.ПриОпределенииИспользуемыхТаблиц = Истина;
КонецПроцедуры

// Список регистров и других объектов метаданных, по которым формируется отчет.
//   Используется для проверки что отчет может содержать не обновленные данные.
//
// Параметры:
//   КлючВарианта - Строка
//                - Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов для варианта расшифровки или без контекста.
//   ИспользуемыеТаблицы - Массив - 
//       Полные имена объектов метаданных (регистров, документов и других таблиц),
//       данные которых выводятся в отчете.
//
Процедура ПриОпределенииИспользуемыхТаблиц(КлючВарианта, ИспользуемыеТаблицы) Экспорт
  ИспользуемыеТаблицы.Добавить(Метаданные.Справочники.ЗадачиМетеор.ПолноеИмя());
  ИспользуемыеТаблицы.Добавить(Метаданные.Справочники.Пользователи.ПолноеИмя());
  ИспользуемыеТаблицы.Добавить(Метаданные.Справочники.РолиИсполнителей.ПолноеИмя());
  ИспользуемыеТаблицы.Добавить(Метаданные.РегистрыСведений.ОценкаТрудозатратПоЗадачам.ПолноеИмя());
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновки = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
    ОчередьСогласованияТрудозатрат = ОчередьСогласованияТрудозатрат();
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ОчередьСогласованияТрудозатрат", ОчередьСогласованияТрудозатрат);
	
	КомпановщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	МакетКомпановки = КомпановщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпановки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОчередьСогласованияТрудозатрат()
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТочкаМаршрутаСогласованиеТрудозатрат",
		БизнесПроцессы.КонтрольТрудозатрат.ТочкиМаршрута.СогласованиеФактическихТрудозатрат);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.КонтрольТрудозатрат).ЗадачаМетеор КАК ЗадачаМетеор
		|ПОМЕСТИТЬ Задачи
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс ССЫЛКА БизнесПроцесс.КонтрольТрудозатрат
		|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрутаСогласованиеТрудозатрат
		|	И НЕ ЗадачаИсполнителя.Выполнена
		|	И НЕ ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс.КонтрольТрудозатрат).ЗадачаМетеор = ЗНАЧЕНИЕ(Справочник.ЗадачиМетеор.ПустаяСсылка)
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи.ЗадачаМетеор КАК ЗадачаМетеор
		|ИЗ
		|	Задачи КАК Задачи";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗадачаМетеор = РезультатЗапроса.Выбрать();
	
	ЧасыПоЗадачам = Справочники.ЗадачиМетеор.ТаблицаЧасовПоЗадаче();
	ЧасыПоЗадачам.Колонки.Добавить("ЗадачаМетеор", Новый ОписаниеТипов("СправочникСсылка.ЗадачиМетеор"));
	
	Пока ВыборкаЗадачаМетеор.Следующий() Цикл
		ЧасыПоЗадаче = Справочники.ЗадачиМетеор.ПолучитьЧасыПоЗадачеМетеор(ВыборкаЗадачаМетеор.ЗадачаМетеор);
		ЧасыПоЗадаче.Колонки.Добавить("ЗадачаМетеор", Новый ОписаниеТипов("СправочникСсылка.ЗадачиМетеор"));
		ЧасыПоЗадаче.ЗаполнитьЗначения(ВыборкаЗадачаМетеор.ЗадачаМетеор, "ЗадачаМетеор");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЧасыПоЗадаче, ЧасыПоЗадачам);
	КонецЦикла;
	
	ЧасыПоЗадачам.Свернуть("ЗадачаМетеор, Пользователь, Роль", "Затрачено");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ЧасыПоЗадачам", ЧасыПоЗадачам);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧасыПоЗадачам.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ЧасыПоЗадачам.Пользователь КАК Пользователь,
		|	ЧасыПоЗадачам.Роль КАК Роль,
		|	ЧасыПоЗадачам.Затрачено КАК Затрачено
		|ПОМЕСТИТЬ ЧасыПоЗадачам
		|ИЗ
		|	&ЧасыПоЗадачам КАК ЧасыПоЗадачам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Исполнитель,
		|	ЧасыПоЗадачам.Пользователь КАК ИсполнительСтрокой,
		|	ЧасыПоЗадачам.Роль КАК РольСтрокой,
		|	ЧасыПоЗадачам.Затрачено КАК Затрачено,
		|	РолиИсполнителей.Ссылка КАК РольИсполнителя,
		|	Пользователи.Команда КАК Команда,
		|	ЧасыПоЗадачам.ЗадачаМетеор КАК ЗадачаМетеор,
		|	Пользователи.Команда.Удалить_Руководитель КАК РуководительКоманды
		|ПОМЕСТИТЬ ИсполнителиЗадачи
		|ИЗ
		|	ЧасыПоЗадачам КАК ЧасыПоЗадачам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ЧасыПоЗадачам.Пользователь = Пользователи.Наименование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиИсполнителей КАК РолиИсполнителей
		|		ПО ЧасыПоЗадачам.Роль = РолиИсполнителей.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОценкаТрудозатратПоЗадачам.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ОценкаТрудозатратПоЗадачам.РольИсполнителяЗадачи КАК РольИсполнителяЗадачи,
		|	ОценкаТрудозатратПоЗадачам.Количество КАК Количество
		|ПОМЕСТИТЬ ОценкаТрудозатратПоЗадачам
		|ИЗ
		|	РегистрСведений.ОценкаТрудозатратПоЗадачам КАК ОценкаТрудозатратПоЗадачам
		|ГДЕ
		|	(ОценкаТрудозатратПоЗадачам.ЗадачаМетеор, ОценкаТрудозатратПоЗадачам.РольИсполнителяЗадачи) В
		|			(ВЫБРАТЬ
		|				ИсполнителиЗадачи.ЗадачаМетеор,
		|				ИсполнителиЗадачи.РольИсполнителя
		|			ИЗ
		|				ИсполнителиЗадачи КАК ИсполнителиЗадачи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задачи.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ИсполнителиЗадачи.Исполнитель КАК Исполнитель,
		|	ИсполнителиЗадачи.РольИсполнителя КАК РольИсполнителя,
		|	ИсполнителиЗадачи.ИсполнительСтрокой КАК ИсполнительСтрокой,
		|	ИсполнителиЗадачи.Затрачено КАК Затрачено,
		|	0 КАК Оценка,
		|	ИсполнителиЗадачи.РуководительКоманды КАК РуководительКоманды,
		|	ИсполнителиЗадачи.Команда КАК Команда
		|ИЗ
		|	Задачи КАК Задачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсполнителиЗадачи КАК ИсполнителиЗадачи
		|		ПО Задачи.ЗадачаМетеор = ИсполнителиЗадачи.ЗадачаМетеор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОценкаТрудозатратПоЗадачам.ЗадачаМетеор,
		|	ОценкаТрудозатратПоЗадачам.РольИсполнителяЗадачи,
		|	ОценкаТрудозатратПоЗадачам.РольИсполнителяЗадачи,
		|	"""",
		|	0,
		|	ОценкаТрудозатратПоЗадачам.Количество,
		|	ЕСТЬNULL(РолиВЗадачеПоКомандам.РуководительКоманды, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)),
		|	ЗНАЧЕНИЕ(Справочник.Команды.ПустаяСсылка)
		|ИЗ
		|	ОценкаТрудозатратПоЗадачам КАК ОценкаТрудозатратПоЗадачам
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ИсполнителиЗадачи.РольИсполнителя КАК РольИсполнителя,
		|			ИсполнителиЗадачи.ЗадачаМетеор КАК ЗадачаМетеор,
		|			ИсполнителиЗадачи.РуководительКоманды КАК РуководительКоманды
		|		ИЗ
		|			ИсполнителиЗадачи КАК ИсполнителиЗадачи) КАК РолиВЗадачеПоКомандам
		|		ПО ОценкаТрудозатратПоЗадачам.ЗадачаМетеор = РолиВЗадачеПоКомандам.ЗадачаМетеор
		|			И ОценкаТрудозатратПоЗадачам.РольИсполнителяЗадачи = РолиВЗадачеПоКомандам.РольИсполнителя";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
